Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མི་རྣམས་ཀྱི་ལོ་ཉིས་བརྒྱ་གང་ཡིན་པ་དེ་ནི། འཐབ་བྲལ་གྱི་ལྷ་རྣམས་ཀྱི་ཉིན་ཞག་གཅིག་གོ། །
en: Two hundred human years equals one day in the Heaven Free from Strife.

source: ཉིན་ཞག་གི་ཚད་དེས་ཞག་སུམ་ཅུ་ལ་ཟླ་བ་གཅིག་གོ། །
en: With the length of such days, thirty days equals a month,

source: འཐབ་བྲལ་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་ལོ་ཉིས་སྟོང་སྟེ།
en: The lifespan of the gods in the Heaven Free from Strife is two thousand such years but

source: མི་རྣམས་ཀྱི་ལོ་བཞི་བརྒྱ་གང་ཡིན་པ་དེ་ནི་དགའ་ལྡན་གྱི་ལྷ་རྣམས་ཀྱི་ཉིན་ཞག་གཅིག་གོ། །
en: Four hundred human years equals one day in the Heaven of Joy.

source: ཉིན་ཞག་གི་ཚད་དེས་ཞེས་བྱ་བ་ནས། ཟླ་བ་བཅུ་གཉིས་དང་ལོའི་བར་དུའོ། །
en: With the length of such days . . . twelve months make a year.

source: དགའ་ལྡན་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་ལོ་བཞི་སྟོང་སྟེ།
en: The lifespan of the gods in the Heaven of Joy is four thousand such years but

source: མི་རྣམས་ཀྱི་ལོ་བརྒྱད་བརྒྱ་གང་ཡིན་པ་ནི། འཕྲུལ་དགའི་ལྷ་རྣམས་ཀྱི་ཉིན་ཞག་གཅིག་གོ། །
en: Eight hundred human years equals one day in the Heaven of Delighting in Emanations.

source: ཉིན་ཞག་གི་ཚད་དེས་ཞེས་བྱ་བ་ནས་ལོའི་བར་དུའོ། །
en: With the length of such days . . . twelve months make a year.

source: འཕྲུལ་དགའི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་སྟོང་སྟེ།
en: The lifespan of the gods in the Heaven of Delighting in Emanations is eight thousand such years but

source: མི་རྣམས་ཀྱི་ལོ་སྟོང་དྲུག་བརྒྱ་གང་ཡིན་པ་དེ་ནི་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ཉིན་ཞག་གཅིག་གོ། །
en: One thousand six hundred human years equals one day in the Heaven of Making Use of Others’ Emanations.

source: གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་ལོ་ཁྲི་དྲུག་སྟོང་སྟེ།
en: The lifespan of the gods in the Heaven of Making Use of Others’ Emanations is sixteen thousand such years but

source: ཚངས་པ་དང་། ཚངས་རིས་དང་། ཚངས་པའི་མདུན་ན་འདོན་དང་། ཚངས་འཁོར་དང་། ཚངས་པ་ཆེན་པོ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་སྟེ།
en: The lifespan of the Brahmā gods and the gods in the Brahmā Realm, the Heaven of the High Priests of Brahmā, the Heaven of the Retinue of Brahmā, and the Heaven of Great Brahmā is one eon but

source: འོད་དང་། འོད་ཆུང་དང་། ཚད་མེད་འོད་དང་། འོད་གསལ་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་གཉིས་ཏེ།
en: The lifespan of the gods in the Heaven of Light, the Heaven of Limited Light, the Heaven of Limitless Light, and the Luminous Heaven is two eons but

source: དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་དང་། དགེ་རྒྱས་ཀྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་བཞི་སྟེ།
en: The lifespan of the gods in the Heaven of Virtue, the Heaven of Limited Virtue, the Heaven of Limitless Virtue, and the Heaven of Perfected Virtue is four eons but

source: ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་དང་། འབྲས་བུ་ཆེ་བའི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་བརྒྱད་དེ།
en: The lifespan of the gods in the Greater Heaven, the Heaven of Lesser Greatness, the Heaven of Limitless Greatness, and the Heaven of Great Fruition is eight eons but

source: འདུ་ཤེས་མེད་པའི་སེམས་ཅན་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་ལྔ་བརྒྱའོ། །
en: The lifespan of the gods without notions is five hundred eons,

source: མི་ཆེ་བ་རྣམས་ཀྱི་ནི་བསྐལ་པ་སྟོང་ངོ་། །
en: in the Unlofty Heaven it is one thousand eons,

source: མི་གདུང་བ་རྣམས་ཀྱི་ནི་བསྐལ་པ་ཉིས་སྟོང་ངོ་། །
en: in the Heaven of No Hardship it is two thousand eons,

source: གྱ་ནོམ་སྣང་བ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་བཞི་སྟོང་སྟེ།
en: and in the Sublime Heaven it is four thousand eons, but

source: ཤིན་ཏུ་མཐོང་གི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་བརྒྱད་སྟོང་སྟེ།
en: The lifespan of the gods in the Gorgeous Heaven is eight thousand eons but they

source: འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་ཁྲི་དྲུག་སྟོང་སྟེ།
en: The lifespan of the gods in the Highest Heaven is sixteen thousand eons but

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་ཉི་ཁྲི་ཆིག་སྟོང་སྟེ།
en: The lifespan of the gods in the sphere of limitless space is twenty-one thousand eons but

source: དུས་མ་ཡིན་པར་འཆི་བ་ཡང་ཡོད་དོ། །
en: they may also die untimely.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་བཞི་ཁྲི་ཉིས་སྟོང་སྟེ།
en: The lifespan of the gods in the sphere of limitless consciousness is forty-two thousand eons but

source: ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་དྲུག་ཁྲི་སུམ་སྟོང་སྟེ།
en: The lifespan of the gods in the sphere of nothing whatsoever is sixty-three thousand eons but

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་སྟེ།
en: The lifespan of the gods in the sphere of neither notion nor no notion is eighty-four thousand eons but

source: རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་གང་ཡིན་པ་དེ་ནི། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཡང་སོས་ཀྱི་ཉིན་ཞག་གཅིག་གོ། །
en: The lifespan of the gods in the Heaven of the Four Great Kings equals one day for beings in the great Hell of Revival.

source: ཉིན་ཞག་གི་ཚེའི་ཚད་དེས་ཞེས་བྱ་བ་ནས་ལོའི་བར་དུའོ། །
en: With the length of such days . . . twelve months make a year.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཡང་སོས་ཀྱི་ཚེའི་ཚད་ནི་ལོ་ལྔ་བརྒྱ་སྟེ།
en: The lifespan of the beings in the great Hell of Revival is five hundred such years but

source: སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཐིག་ནག་གི་ཉིན་ཞག་གཅིག་གོ། །
en: The lifespan of the gods in the Heaven of the Thirty-Three equals a day for beings in the great Hell of Black Lines.

source: ཉིན་ཞག་དེས་ཞེས་བྱ་བ་ནས་ལོའི་བར་དུའོ། །
en: With the length of such days . . . twelve months make a year.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཐིག་ནག་གི་ཚེའི་ཚད་ནི་ལོ་སྟོང་སྟེ།
en: The lifespan of the beings in the great Hell of Black Lines is one thousand such years but

source: འཐབ་བྲལ་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ངུ་འབོད་ཀྱི་ཉིན་ཞག་གཅིག་གོ། །
en: The lifespan of the gods in the Heaven Free from Strife equals a day for beings in the great Hell of Howling.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ངུ་འབོད་ཀྱི་ཚེའི་ཚད་ནི་ལོ་ཉིས་སྟོང་ངོ་། །
en: The lifespan of the beings in the great Hell of Howling is two thousand such years.

source: དགའ་ལྡན་གྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་གང་ཡིན་པ་དེ་ནི། ངུ་འབོད་གཏུམ་པོའི་ཉིན་ཞག་གཅིག་གོ། །
en: The lifespan of the gods in the Heaven of Joy equals a day for beings in the great Hell of Fierce Howling.

source: ཉིན་ཞག་དེས་ཞེས་བྱ་བ་ནས་ལོའི་བར་དུ་སྟེ།
en: With the length of such days . . . twelve months make a year.

source: ཚེའི་ཚད་ལོ་བཞི་སྟོང་ངོ་། །
en: The lifespan of these beings is four thousand such years.

source: འཕྲུལ་དགའི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་གང་ཡིན་པ་དེ་ནི། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཚ་བའི་ཉིན་ཞག་གཅིག་གོ། །
en: The lifespan of the gods in the Heaven of Delighting in Emanations equals a day for beings in the great Hell of Heat.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཚ་བ་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་སྟོང་ངོ་། །
en: The lifespan of the beings in the great Hell of Heat is eight thousand such years.

source: གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རབ་ཏུ་ཚ་བའི་ཉིན་ཞག་གཅིག་གོ། །
en: The lifespan of the gods in the Heaven of Making Use of Others’ Emanations equals a day for beings in the great Hell of Great Heat.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རབ་ཏུ་ཚ་བའི་ཚེའི་ཚད་ནི་ལོ་དྲུག་སྟོང་ངོ་། །
en: The lifespan of the beings in the great Hell of Great Heat is six thousand such years.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བསྡུས་གཞོམ་གྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་ཕྱེད་དེ།
en: The lifespan of the beings in the great Hell of Crushing is half an eon but

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པའི་ཚེའི་ཚད་ནི་བསྐལ་པ་སྟེ།
en: The lifespan of the beings in the great Hell of Incessant Pain is one eon but

source: འདི་ལྟ་སྟེ་དཔེར་ན། ཡུལ་མ་ག་དྷཱའི་ཁལ་གསུམ་བྲེ་བཞིའི་ཕྲག་ཉི་ཤུ་ལ། ཏིལ་ཁལ་དྲུག་ཅུ་རྩ་བཞི་སྟེ།
en: As an illustration, in Magadha three bushels equals eighty āḍaka measures, which again equals sixty-four sesame seed bushels.

source: དེ་ལས་ལོ་བརྒྱ་འདས་ཤིང་མིས་ཏིལ་འབྲུ་གཅིག་བོར་ཏེ།
en: Now, suppose that once every hundred years a person were to remove a single seed from that pile.

source: རྣམ་གྲངས་དང་ཐབས་དེ་ལྟ་བུས་ཡུལ་མ་ག་དྷཱའི་ཏིལ་ཁལ་དྲུག་ཅུ་རྩ་བཞི་ལས་ཟད་པར་གྱུར་ཀྱང་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཆུ་བུར་ཅན་གྱི་ཚེའི་ཚད་ནི་དེ་ལྟར་མི་ཟད་དོ། །
en: In the time that it would take to exhaust those sixty-four Magadha sesame seed bushels in that way and using that method, the lifespan of the beings in the great Hell of Blisters still would not have come to an end.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཆུ་བུར་ཅན་གྱི་ཚེའི་ཚད་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཆུ་བུར་རྡོལ་གྱི་ཚེའི་ཚད་གཅིག་ཡིན་ནོ། །
en: Twenty times the lifespan of the beings in the great Hell of Blisters equals a single lifespan of the beings in the great Hell of Bursting Blisters.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཆུ་བུར་རྡོལ་གྱི་ཚེའི་ཚད་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་སོ་ཏམས་ཏམས་ཀྱི་ཚེའི་ཚད་གཅིག་ཡིན་ནོ། །
en: Twenty times the lifespan of the beings in the great Hell of Bursting Blisters equals a single lifespan of the beings in the great Hell of Chattering Teeth.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་སོ་ཏམས་ཏམས་ཀྱི་ཚེའི་ཚད་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་ཀྱི་ཧུད་ཟེར་གྱི་ཚེའི་ཚད་གཅིག་གོ། །
en: Twenty times the lifespan of the beings in the great Hell of Chattering Teeth equals a single lifespan in the great Hell of Groans.

source: ཀྱི་ཧུད་ཟེར་གྱི་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་ཨ་ཆུ་ཟེར་གྱི་གཅིག་གོ། །
en: Twenty lives in Groans equals a single lifespan in the great Hell of Lamentations.

source: ཨ་ར་ཌེའི་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་མེ་ཏོག་དྲི་ཞིམ་ལྟར་གས་པའི་གཅིག་གོ། །
en: Twenty times the lifespan in Lamentations equals a single life in the great Hell of Cracked Like Sweet Smelling Flowers.

source: མེ་ཏོག་དྲི་ཞིམ་ལྟར་གས་པའི་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་མེ་ཏོག་དྲི་ངད་འཇམ་ལྟར་གས་པའི་གཅིག་གོ། །
en: Twenty lives in Cracked Like Sweet Smelling Flowers equals a single life in the great Hell of Cracked Like Smooth Fragrant Flowers.

source: མེ་ཏོག་དྲི་ངད་འཇམ་ལྟར་གས་པའི་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་ཨུད་པ་ལ་ལྟར་གས་པའི་གཅིག་གོ །
en: Twenty lives in Cracked Like Smooth Fragrant Flowers equals a single life in the great Hell of Cracked Like Blue Lotus Flowers.

source: ཨུད་པ་ལ་ལྟར་གས་པའི་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་ཀུ་མུ་ད་ལྟར་གས་པའི་གཅིག་གོ། །
en: Twenty lives in Cracked Like Blue Lotus Flowers equals a single life in the great Hell of Cracked Like Pink Lotus Flowers.

source: ཀུ་མུ་ད་ལྟར་གས་པའི་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་པད་མ་དཀར་པོ་ལྟར་གས་པའི་གཅིག་གོ། །
en: Twenty lives in Cracked Like Pink Lotus Flowers equals a single life in the great Hell of Cracked Like White Lotus Flowers.

source: པད་མ་དཀར་པོ་ལྟར་གས་པའི་ཉི་ཤུ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་པད་མ་ལྟར་གས་པའི་ཚེའི་ཚད་གཅིག་ཡིན་ནོ། །
en: Twenty lives in Cracked Like White Lotus Flowers equals a single life in the great Hell of Cracked Like Lotus Flowers.

source: ཁྱིམ་བདག་དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ཚེའི་དབང་པོ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: Householder, to know, see, perceive, realize, understand, and be skillful about this is called knowing the life faculty .

source: དེ་བཞིན་གཤེགས་པ་ཚེའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the life faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཚེའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the life faculty.

source: ཚེའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands how to gain knowledge of the origin as related to knowledge of the life faculty,

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཚེའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the life faculty.

source: དེ་བཞིན་གཤེགས་པ་ཚེའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the life faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཚེའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the life faculty.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་ཚེའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of the life faculty.

source: འདི་ནི་ཚེའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: That is called knowing cessation as related to knowledge of the life faculty .

source: དེ་བཞིན་གཤེགས་པ་ཚེའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the life faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཚེའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the life faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་ཚེའི་དབང་པོ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the life faculty.

source: དེ་བཞིན་གཤེགས་པ་ཚེའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the life faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བདེ་བའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the pleasure faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་བདེ་བའི་ཚོར་བ་འམ། ཚོར་བའི་རྣམ་པ་བདེ་བ་གང་ཅུང་ཟད་ཡོད་པ་ཡང་དག་པར་ཡོངས་སུ་སྤྱད་པའམ། མི་འཐུན་པར་ཡོངས་སུ་སྤྱད་པའམ། སྤྱོད་ལམ་པའམ། དུས་ཚིགས་ཀྱིས་ཡོངས་སུ་བསྒྱུར་བ་འདི་ནི་བདེ་བའི་དབང་པོ་ཤེས་པ་ཞེས་བྱའོ། །
en: Householder, the Thus-Gone One knows that ‘the pleasure faculty’ refers to any pleasurable physical feeling or any genuinely enjoyable or pleasurable aspect of feeling, no matter how small, which is enjoyed purely, or enjoyed in an incorrect manner, and which is transformed through certain acts or with the passing of time.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་བདེ་བའི་དབང་པོ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the pleasure faculty .

source: དེ་བཞིན་གཤེགས་པ་བདེ་བའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the pleasure faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྡུག་བསྔལ་གྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the displeasure faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་སྡུག་བསྔལ་གྱི་ཚོར་བའམ། ཚོར་བའི་རྣམ་པ་གང་ཅུང་ཟད་ཡང་དག་པར་ཡོངས་སུ་བསྒྱུར་བའམ། མི་འཐུན་པར་ཡོངས་སུ་བསྒྱུར་བའམ། དུས་ཚིགས་ཀྱིས་ཡོངས་སུ་བསྒྱུར་བའམ། སྤྱོད་ལམ་པ་འདི་ནི་སྡུག་བསྔལ་གྱི་དབང་པོ་ཞེས་བྱ་སྟེ
en: Householder, the Thus-Gone One knows that ‘the displeasure faculty’ refers to any unpleasant physical feeling, or any such aspect of feeling, no matter how small, which is transformed and changes in a disagreeable manner, whether over time or through certain acts.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་སྡུག་བསྔལ་གྱི་དབང་པོ་ཤེས་པ་ཞེས་བྱའོ། །
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the displeasure faculty .

source: དེ་བཞིན་གཤེགས་པ་སྡུག་བསྔལ་གྱི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the displeasure faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཡིད་བདེ་བའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the happiness faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ལས་བྱུང་བའི་བདེ་བའི་ཚོར་བའམ། ཚོར་བའི་རྣམ་པ་བདེ་བ་གང་ཅུང་ཟད་ཡང་དག་པར་ཡོངས་སུ་བསྒྱུར་བའམ། མི་འཐུན་པར་ཡོངས་སུ་བསྒྱུར་བའམ། དུས་ཚིགས་ཀྱིས་ཡོངས་སུ་བསྒྱུར་བའམ། སྤྱོད་ལམ་འདི་ནི་ཡིད་བདེ་བའི་དབང་པོ་ཞེས་བྱའོ། །
en: Householder, the Thus-Gone One knows that ‘the happiness faculty’ refers to any pleasant mental feeling, or any aspect of such feelings, no matter how small, and whether it is transformed by its opposite, or over time or through certain acts.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ཡིད་བདེ་བའི་དབང་པོ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the happiness faculty .

source: དེ་བཞིན་གཤེགས་པ་ཡིད་བདེ་བའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the happiness faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཡིད་མི་བདེ་བའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the unhappiness faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ལས་བྱུང་བ་སྡུག་བསྔལ་གྱི་ཚོར་བའམ། ཚོར་བའི་རྣམ་པ་མི་བདེ་བ་གང་ཅུང་ཟད་ཡང་དག་པར་ཡོངས་སུ་བསྒྱུར་བའམ། མི་འཐུན་པར་ཡོངས་སུ་བསྒྱུར་བའམ། དུས་ཚིགས་ཀྱིས་ཡོངས་སུ་བསྒྱུར་བའམ། སྤྱོད་ལམ་པ་འདི་ནི་ཡིད་མི་བདེ་བའི་དབང་པོ་ཞེས་བྱའོ། །
en: Householder, the Thus-Gone One knows that ‘the unhappiness faculty’ refers to any unpleasant mental feeling, or any aspect of such feelings, no matter how small, and whether it is transformed by its opposite, or over time or through certain acts.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ཡིད་མི་བདེ་བའི་དབང་པོ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the unhappiness faculty .

source: ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་ཡང་ཇི་སྐད་བསྟན་པ་བཞིན་རྒྱ་ཆེར་བྱའོ། །
en: The origin , cessation, and path should be explained in detail as they have been previously taught.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བཏང་སྙོམས་ཀྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the equanimity faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱིའམ། སེམས་ལས་བྱུང་བའི་ཚོར་བའམ། ཚོར་བའི་རྣམ་པ་བདེ་བ་ཉིད་མ་ཡིན་པའམ། མི་བདེ་བ་ཉིད་མ་ཡིན་པ་གང་ཅུང་ཟད་ཡང་དག་པར་ཡོངས་སུ་བསྒྱུར་བའམ། མི་འཐུན་པར་ཡོངས་སུ་བསྒྱུར་བའམ། དུས་ཚིགས་ཀྱིས་ཡོངས་སུ་བསྒྱུར་བའམ། སྤྱོད་ལམ་པ་འདི་ནི་བཏང་སྙོམས་ཀྱི་དབང་པོ་ཞེས་བྱའོ། །
en: Householder, the Thus-Gone One knows that ‘the equanimity faculty’ refers to any physical or mental feeling, or any aspect of feeling that is neither pleasant nor unpleasant, no matter how small, and whether it is transformed by its opposite, or over time or through certain acts.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་བཏང་སྙོམས་ཀྱི་དབང་པོ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the equanimity faculty .

source: དེ་བཞིན་གཤེགས་པ་བཏང་སྙོམས་ཀྱི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the equanimity faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དད་པའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the faith faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་དགེ་བའི་ཆོས་རྣམས་ལ་དོན་དུ་གཉེར་བ་ཉིད་དང་། འདུན་པ་དང་། འདོད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ངེས་པར་རྟོགས་པ་དང་། མངོན་པར་རྟོགས་པ་དང་། དང་བ་དང་། ཤིན་ཏུ་དང་བ་དང་། སེམས་རྙོག་པ་མེད་པ་དང་། དད་པའི་དབང་པོ་དང་། དད་པའི་སྟོབས་གང་ཡིན་པ་འདི་ནི་དད་པའི་དབང་པོའོ། །
en: Householder, the Thus-Gone One knows that the faith faculty is to strive toward, aspire to, and wish for virtuous qualities. It is to realize and actualize the factors of awakening. It is to be inspired, enthusiastic, and mentally unpolluted with regard to these factors. It is the faculty of faith and the power of faith.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་དད་པའི་དབང་པོ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see, perceive, . . . and be skillful about this is called knowing the faith faculty .

source: དེ་བཞིན་གཤེགས་པ་དད་པའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the faith faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དད་པའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the faith faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་དད་པའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the causes and conditions that accomplish knowledge of the origin as related to knowledge of the faith faculty.

source: དེ་བཞིན་གཤེགས་པ་དད་པའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the faith faculty,

source: དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ།
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དད་པའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the faith faculty.

source: རྒྱུ་གང་དག་ཡོད་ན་དད་པའི་དབང་པོ་སྐྱེ་སྟེ། རྒྱུ་དེ་དག་འགོག་པ་ནི་དད་པའི་དབང་པོ་འགོག་པ་སྟེ།
en: When the causes cease by which the faculty of faith arises, that is the cessation as related to the faith faculty.

source: དེ་བཞིན་གཤེགས་པ་དད་པའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the faith faculty,

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་དེ་ནི་ཙན་དན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་འདི་ལ་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དད་པའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the faith faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་དད་པའི་དབང་པོ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the faith faculty.

source: དེ་བཞིན་གཤེགས་པ་དད་པའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the faith faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the diligence faculty.
